ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/devices/include/ip/cyip_sdhc.h
/* SDHC_CORE.SDMASA_R */
#define SDHC_CORE_SDMASA_R_BLOCKCNT_SDMASA_Pos  0UL
#define SDHC_CORE_SDMASA_R_BLOCKCNT_SDMASA_Msk  0xFFFFFFFFUL
/* SDHC_CORE.BLOCKSIZE_R */
#define SDHC_CORE_BLOCKSIZE_R_XFER_BLOCK_SIZE_Pos 0UL
#define SDHC_CORE_BLOCKSIZE_R_XFER_BLOCK_SIZE_Msk 0xFFFUL
#define SDHC_CORE_BLOCKSIZE_R_SDMA_BUF_BDARY_Pos 12UL
#define SDHC_CORE_BLOCKSIZE_R_SDMA_BUF_BDARY_Msk 0x7000UL
/* SDHC_CORE.BLOCKCOUNT_R */
#define SDHC_CORE_BLOCKCOUNT_R_BLOCK_CNT_Pos    0UL
#define SDHC_CORE_BLOCKCOUNT_R_BLOCK_CNT_Msk    0xFFFFUL
/* SDHC_CORE.ARGUMENT_R */
#define SDHC_CORE_ARGUMENT_R_ARGUMENT_Pos       0UL
#define SDHC_CORE_ARGUMENT_R_ARGUMENT_Msk       0xFFFFFFFFUL
/* SDHC_CORE.XFER_MODE_R */
#define SDHC_CORE_XFER_MODE_R_DMA_ENABLE_Pos    0UL
#define SDHC_CORE_XFER_MODE_R_DMA_ENABLE_Msk    0x1UL
#define SDHC_CORE_XFER_MODE_R_BLOCK_COUNT_ENABLE_Pos 1UL
#define SDHC_CORE_XFER_MODE_R_BLOCK_COUNT_ENABLE_Msk 0x2UL
#define SDHC_CORE_XFER_MODE_R_AUTO_CMD_ENABLE_Pos 2UL
#define SDHC_CORE_XFER_MODE_R_AUTO_CMD_ENABLE_Msk 0xCUL
#define SDHC_CORE_XFER_MODE_R_DATA_XFER_DIR_Pos 4UL
#define SDHC_CORE_XFER_MODE_R_DATA_XFER_DIR_Msk 0x10UL
#define SDHC_CORE_XFER_MODE_R_MULTI_BLK_SEL_Pos 5UL
#define SDHC_CORE_XFER_MODE_R_MULTI_BLK_SEL_Msk 0x20UL
#define SDHC_CORE_XFER_MODE_R_RESP_TYPE_Pos     6UL
#define SDHC_CORE_XFER_MODE_R_RESP_TYPE_Msk     0x40UL
#define SDHC_CORE_XFER_MODE_R_RESP_ERR_CHK_ENABLE_Pos 7UL
#define SDHC_CORE_XFER_MODE_R_RESP_ERR_CHK_ENABLE_Msk 0x80UL
#define SDHC_CORE_XFER_MODE_R_RESP_INT_DISABLE_Pos 8UL
#define SDHC_CORE_XFER_MODE_R_RESP_INT_DISABLE_Msk 0x100UL
/* SDHC_CORE.CMD_R */
#define SDHC_CORE_CMD_R_RESP_TYPE_SELECT_Pos    0UL
#define SDHC_CORE_CMD_R_RESP_TYPE_SELECT_Msk    0x3UL
#define SDHC_CORE_CMD_R_SUB_CMD_FLAG_Pos        2UL
#define SDHC_CORE_CMD_R_SUB_CMD_FLAG_Msk        0x4UL
#define SDHC_CORE_CMD_R_CMD_CRC_CHK_ENABLE_Pos  3UL
#define SDHC_CORE_CMD_R_CMD_CRC_CHK_ENABLE_Msk  0x8UL
#define SDHC_CORE_CMD_R_CMD_IDX_CHK_ENABLE_Pos  4UL
#define SDHC_CORE_CMD_R_CMD_IDX_CHK_ENABLE_Msk  0x10UL
#define SDHC_CORE_CMD_R_DATA_PRESENT_SEL_Pos    5UL
#define SDHC_CORE_CMD_R_DATA_PRESENT_SEL_Msk    0x20UL
#define SDHC_CORE_CMD_R_CMD_TYPE_Pos            6UL
#define SDHC_CORE_CMD_R_CMD_TYPE_Msk            0xC0UL
#define SDHC_CORE_CMD_R_CMD_INDEX_Pos           8UL
#define SDHC_CORE_CMD_R_CMD_INDEX_Msk           0x3F00UL
/* SDHC_CORE.RESP01_R */
#define SDHC_CORE_RESP01_R_RESP01_Pos           0UL
#define SDHC_CORE_RESP01_R_RESP01_Msk           0xFFFFFFFFUL
/* SDHC_CORE.RESP23_R */
#define SDHC_CORE_RESP23_R_RESP23_Pos           0UL
#define SDHC_CORE_RESP23_R_RESP23_Msk           0xFFFFFFFFUL
/* SDHC_CORE.RESP45_R */
#define SDHC_CORE_RESP45_R_RESP45_Pos           0UL
#define SDHC_CORE_RESP45_R_RESP45_Msk           0xFFFFFFFFUL
/* SDHC_CORE.RESP67_R */
#define SDHC_CORE_RESP67_R_RESP67_Pos           0UL
#define SDHC_CORE_RESP67_R_RESP67_Msk           0xFFFFFFFFUL
/* SDHC_CORE.BUF_DATA_R */
#define SDHC_CORE_BUF_DATA_R_BUF_DATA_Pos       0UL
#define SDHC_CORE_BUF_DATA_R_BUF_DATA_Msk       0xFFFFFFFFUL
/* SDHC_CORE.PSTATE_REG */
#define SDHC_CORE_PSTATE_REG_CMD_INHIBIT_Pos    0UL
#define SDHC_CORE_PSTATE_REG_CMD_INHIBIT_Msk    0x1UL
#define SDHC_CORE_PSTATE_REG_CMD_INHIBIT_DAT_Pos 1UL
#define SDHC_CORE_PSTATE_REG_CMD_INHIBIT_DAT_Msk 0x2UL
#define SDHC_CORE_PSTATE_REG_DAT_LINE_ACTIVE_Pos 2UL
#define SDHC_CORE_PSTATE_REG_DAT_LINE_ACTIVE_Msk 0x4UL
#define SDHC_CORE_PSTATE_REG_DAT_7_4_Pos        4UL
#define SDHC_CORE_PSTATE_REG_DAT_7_4_Msk        0xF0UL
#define SDHC_CORE_PSTATE_REG_WR_XFER_ACTIVE_Pos 8UL
#define SDHC_CORE_PSTATE_REG_WR_XFER_ACTIVE_Msk 0x100UL
#define SDHC_CORE_PSTATE_REG_RD_XFER_ACTIVE_Pos 9UL
#define SDHC_CORE_PSTATE_REG_RD_XFER_ACTIVE_Msk 0x200UL
#define SDHC_CORE_PSTATE_REG_BUF_WR_ENABLE_Pos  10UL
#define SDHC_CORE_PSTATE_REG_BUF_WR_ENABLE_Msk  0x400UL
#define SDHC_CORE_PSTATE_REG_BUF_RD_ENABLE_Pos  11UL
#define SDHC_CORE_PSTATE_REG_BUF_RD_ENABLE_Msk  0x800UL
#define SDHC_CORE_PSTATE_REG_CARD_INSERTED_Pos  16UL
#define SDHC_CORE_PSTATE_REG_CARD_INSERTED_Msk  0x10000UL
#define SDHC_CORE_PSTATE_REG_CARD_STABLE_Pos    17UL
#define SDHC_CORE_PSTATE_REG_CARD_STABLE_Msk    0x20000UL
#define SDHC_CORE_PSTATE_REG_CARD_DETECT_PIN_LEVEL_Pos 18UL
#define SDHC_CORE_PSTATE_REG_CARD_DETECT_PIN_LEVEL_Msk 0x40000UL
#define SDHC_CORE_PSTATE_REG_WR_PROTECT_SW_LVL_Pos 19UL
#define SDHC_CORE_PSTATE_REG_WR_PROTECT_SW_LVL_Msk 0x80000UL
#define SDHC_CORE_PSTATE_REG_DAT_3_0_Pos        20UL
#define SDHC_CORE_PSTATE_REG_DAT_3_0_Msk        0xF00000UL
#define SDHC_CORE_PSTATE_REG_CMD_LINE_LVL_Pos   24UL
#define SDHC_CORE_PSTATE_REG_CMD_LINE_LVL_Msk   0x1000000UL
#define SDHC_CORE_PSTATE_REG_HOST_REG_VOL_Pos   25UL
#define SDHC_CORE_PSTATE_REG_HOST_REG_VOL_Msk   0x2000000UL
#define SDHC_CORE_PSTATE_REG_CMD_ISSU_ERR_Pos   27UL
#define SDHC_CORE_PSTATE_REG_CMD_ISSU_ERR_Msk   0x8000000UL
#define SDHC_CORE_PSTATE_REG_SUB_CMD_STAT_Pos   28UL
#define SDHC_CORE_PSTATE_REG_SUB_CMD_STAT_Msk   0x10000000UL
/* SDHC_CORE.HOST_CTRL1_R */
#define SDHC_CORE_HOST_CTRL1_R_LED_CTRL_Pos     0UL
#define SDHC_CORE_HOST_CTRL1_R_LED_CTRL_Msk     0x1UL
#define SDHC_CORE_HOST_CTRL1_R_DAT_XFER_WIDTH_Pos 1UL
#define SDHC_CORE_HOST_CTRL1_R_DAT_XFER_WIDTH_Msk 0x2UL
#define SDHC_CORE_HOST_CTRL1_R_HIGH_SPEED_EN_Pos 2UL
#define SDHC_CORE_HOST_CTRL1_R_HIGH_SPEED_EN_Msk 0x4UL
#define SDHC_CORE_HOST_CTRL1_R_DMA_SEL_Pos      3UL
#define SDHC_CORE_HOST_CTRL1_R_DMA_SEL_Msk      0x18UL
#define SDHC_CORE_HOST_CTRL1_R_EXT_DAT_XFER_Pos 5UL
#define SDHC_CORE_HOST_CTRL1_R_EXT_DAT_XFER_Msk 0x20UL
#define SDHC_CORE_HOST_CTRL1_R_CARD_DETECT_TEST_LVL_Pos 6UL
#define SDHC_CORE_HOST_CTRL1_R_CARD_DETECT_TEST_LVL_Msk 0x40UL
#define SDHC_CORE_HOST_CTRL1_R_CARD_DETECT_SIG_SEL_Pos 7UL
#define SDHC_CORE_HOST_CTRL1_R_CARD_DETECT_SIG_SEL_Msk 0x80UL
/* SDHC_CORE.PWR_CTRL_R */
#define SDHC_CORE_PWR_CTRL_R_SD_BUS_PWR_VDD1_Pos 0UL
#define SDHC_CORE_PWR_CTRL_R_SD_BUS_PWR_VDD1_Msk 0x1UL
#define SDHC_CORE_PWR_CTRL_R_SD_BUS_VOL_VDD1_Pos 1UL
#define SDHC_CORE_PWR_CTRL_R_SD_BUS_VOL_VDD1_Msk 0xEUL
/* SDHC_CORE.BGAP_CTRL_R */
#define SDHC_CORE_BGAP_CTRL_R_STOP_BG_REQ_Pos   0UL
#define SDHC_CORE_BGAP_CTRL_R_STOP_BG_REQ_Msk   0x1UL
#define SDHC_CORE_BGAP_CTRL_R_CONTINUE_REQ_Pos  1UL
#define SDHC_CORE_BGAP_CTRL_R_CONTINUE_REQ_Msk  0x2UL
#define SDHC_CORE_BGAP_CTRL_R_RD_WAIT_CTRL_Pos  2UL
#define SDHC_CORE_BGAP_CTRL_R_RD_WAIT_CTRL_Msk  0x4UL
#define SDHC_CORE_BGAP_CTRL_R_INT_AT_BGAP_Pos   3UL
#define SDHC_CORE_BGAP_CTRL_R_INT_AT_BGAP_Msk   0x8UL
/* SDHC_CORE.WUP_CTRL_R */
#define SDHC_CORE_WUP_CTRL_R_WUP_CARD_INT_Pos   0UL
#define SDHC_CORE_WUP_CTRL_R_WUP_CARD_INT_Msk   0x1UL
#define SDHC_CORE_WUP_CTRL_R_WUP_CARD_INSERT_Pos 1UL
#define SDHC_CORE_WUP_CTRL_R_WUP_CARD_INSERT_Msk 0x2UL
#define SDHC_CORE_WUP_CTRL_R_WUP_CARD_REMOVAL_Pos 2UL
#define SDHC_CORE_WUP_CTRL_R_WUP_CARD_REMOVAL_Msk 0x4UL
/* SDHC_CORE.CLK_CTRL_R */
#define SDHC_CORE_CLK_CTRL_R_INTERNAL_CLK_EN_Pos 0UL
#define SDHC_CORE_CLK_CTRL_R_INTERNAL_CLK_EN_Msk 0x1UL
#define SDHC_CORE_CLK_CTRL_R_INTERNAL_CLK_STABLE_Pos 1UL
#define SDHC_CORE_CLK_CTRL_R_INTERNAL_CLK_STABLE_Msk 0x2UL
#define SDHC_CORE_CLK_CTRL_R_SD_CLK_EN_Pos      2UL
#define SDHC_CORE_CLK_CTRL_R_SD_CLK_EN_Msk      0x4UL
#define SDHC_CORE_CLK_CTRL_R_PLL_ENABLE_Pos     3UL
#define SDHC_CORE_CLK_CTRL_R_PLL_ENABLE_Msk     0x8UL
#define SDHC_CORE_CLK_CTRL_R_CLK_GEN_SELECT_Pos 5UL
#define SDHC_CORE_CLK_CTRL_R_CLK_GEN_SELECT_Msk 0x20UL
#define SDHC_CORE_CLK_CTRL_R_UPPER_FREQ_SEL_Pos 6UL
#define SDHC_CORE_CLK_CTRL_R_UPPER_FREQ_SEL_Msk 0xC0UL
#define SDHC_CORE_CLK_CTRL_R_FREQ_SEL_Pos       8UL
#define SDHC_CORE_CLK_CTRL_R_FREQ_SEL_Msk       0xFF00UL
/* SDHC_CORE.TOUT_CTRL_R */
#define SDHC_CORE_TOUT_CTRL_R_TOUT_CNT_Pos      0UL
#define SDHC_CORE_TOUT_CTRL_R_TOUT_CNT_Msk      0xFUL
/* SDHC_CORE.SW_RST_R */
#define SDHC_CORE_SW_RST_R_SW_RST_ALL_Pos       0UL
#define SDHC_CORE_SW_RST_R_SW_RST_ALL_Msk       0x1UL
#define SDHC_CORE_SW_RST_R_SW_RST_CMD_Pos       1UL
#define SDHC_CORE_SW_RST_R_SW_RST_CMD_Msk       0x2UL
#define SDHC_CORE_SW_RST_R_SW_RST_DAT_Pos       2UL
#define SDHC_CORE_SW_RST_R_SW_RST_DAT_Msk       0x4UL
/* SDHC_CORE.NORMAL_INT_STAT_R */
#define SDHC_CORE_NORMAL_INT_STAT_R_CMD_COMPLETE_Pos 0UL
#define SDHC_CORE_NORMAL_INT_STAT_R_CMD_COMPLETE_Msk 0x1UL
#define SDHC_CORE_NORMAL_INT_STAT_R_XFER_COMPLETE_Pos 1UL
#define SDHC_CORE_NORMAL_INT_STAT_R_XFER_COMPLETE_Msk 0x2UL
#define SDHC_CORE_NORMAL_INT_STAT_R_BGAP_EVENT_Pos 2UL
#define SDHC_CORE_NORMAL_INT_STAT_R_BGAP_EVENT_Msk 0x4UL
#define SDHC_CORE_NORMAL_INT_STAT_R_DMA_INTERRUPT_Pos 3UL
#define SDHC_CORE_NORMAL_INT_STAT_R_DMA_INTERRUPT_Msk 0x8UL
#define SDHC_CORE_NORMAL_INT_STAT_R_BUF_WR_READY_Pos 4UL
#define SDHC_CORE_NORMAL_INT_STAT_R_BUF_WR_READY_Msk 0x10UL
#define SDHC_CORE_NORMAL_INT_STAT_R_BUF_RD_READY_Pos 5UL
#define SDHC_CORE_NORMAL_INT_STAT_R_BUF_RD_READY_Msk 0x20UL
#define SDHC_CORE_NORMAL_INT_STAT_R_CARD_INSERTION_Pos 6UL
#define SDHC_CORE_NORMAL_INT_STAT_R_CARD_INSERTION_Msk 0x40UL
#define SDHC_CORE_NORMAL_INT_STAT_R_CARD_REMOVAL_Pos 7UL
#define SDHC_CORE_NORMAL_INT_STAT_R_CARD_REMOVAL_Msk 0x80UL
#define SDHC_CORE_NORMAL_INT_STAT_R_CARD_INTERRUPT_Pos 8UL
#define SDHC_CORE_NORMAL_INT_STAT_R_CARD_INTERRUPT_Msk 0x100UL
#define SDHC_CORE_NORMAL_INT_STAT_R_FX_EVENT_Pos 13UL
#define SDHC_CORE_NORMAL_INT_STAT_R_FX_EVENT_Msk 0x2000UL
#define SDHC_CORE_NORMAL_INT_STAT_R_CQE_EVENT_Pos 14UL
#define SDHC_CORE_NORMAL_INT_STAT_R_CQE_EVENT_Msk 0x4000UL
#define SDHC_CORE_NORMAL_INT_STAT_R_ERR_INTERRUPT_Pos 15UL
#define SDHC_CORE_NORMAL_INT_STAT_R_ERR_INTERRUPT_Msk 0x8000UL
/* SDHC_CORE.ERROR_INT_STAT_R */
#define SDHC_CORE_ERROR_INT_STAT_R_CMD_TOUT_ERR_Pos 0UL
#define SDHC_CORE_ERROR_INT_STAT_R_CMD_TOUT_ERR_Msk 0x1UL
#define SDHC_CORE_ERROR_INT_STAT_R_CMD_CRC_ERR_Pos 1UL
#define SDHC_CORE_ERROR_INT_STAT_R_CMD_CRC_ERR_Msk 0x2UL
#define SDHC_CORE_ERROR_INT_STAT_R_CMD_END_BIT_ERR_Pos 2UL
#define SDHC_CORE_ERROR_INT_STAT_R_CMD_END_BIT_ERR_Msk 0x4UL
#define SDHC_CORE_ERROR_INT_STAT_R_CMD_IDX_ERR_Pos 3UL
#define SDHC_CORE_ERROR_INT_STAT_R_CMD_IDX_ERR_Msk 0x8UL
#define SDHC_CORE_ERROR_INT_STAT_R_DATA_TOUT_ERR_Pos 4UL
#define SDHC_CORE_ERROR_INT_STAT_R_DATA_TOUT_ERR_Msk 0x10UL
#define SDHC_CORE_ERROR_INT_STAT_R_DATA_CRC_ERR_Pos 5UL
#define SDHC_CORE_ERROR_INT_STAT_R_DATA_CRC_ERR_Msk 0x20UL
#define SDHC_CORE_ERROR_INT_STAT_R_DATA_END_BIT_ERR_Pos 6UL
#define SDHC_CORE_ERROR_INT_STAT_R_DATA_END_BIT_ERR_Msk 0x40UL
#define SDHC_CORE_ERROR_INT_STAT_R_CUR_LMT_ERR_Pos 7UL
#define SDHC_CORE_ERROR_INT_STAT_R_CUR_LMT_ERR_Msk 0x80UL
#define SDHC_CORE_ERROR_INT_STAT_R_AUTO_CMD_ERR_Pos 8UL
#define SDHC_CORE_ERROR_INT_STAT_R_AUTO_CMD_ERR_Msk 0x100UL
#define SDHC_CORE_ERROR_INT_STAT_R_ADMA_ERR_Pos 9UL
#define SDHC_CORE_ERROR_INT_STAT_R_ADMA_ERR_Msk 0x200UL
#define SDHC_CORE_ERROR_INT_STAT_R_TUNING_ERR_Pos 10UL
#define SDHC_CORE_ERROR_INT_STAT_R_TUNING_ERR_Msk 0x400UL
#define SDHC_CORE_ERROR_INT_STAT_R_RESP_ERR_Pos 11UL
#define SDHC_CORE_ERROR_INT_STAT_R_RESP_ERR_Msk 0x800UL
#define SDHC_CORE_ERROR_INT_STAT_R_BOOT_ACK_ERR_Pos 12UL
#define SDHC_CORE_ERROR_INT_STAT_R_BOOT_ACK_ERR_Msk 0x1000UL
/* SDHC_CORE.NORMAL_INT_STAT_EN_R */
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_CMD_COMPLETE_STAT_EN_Pos 0UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_CMD_COMPLETE_STAT_EN_Msk 0x1UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_XFER_COMPLETE_STAT_EN_Pos 1UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_XFER_COMPLETE_STAT_EN_Msk 0x2UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_BGAP_EVENT_STAT_EN_Pos 2UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_BGAP_EVENT_STAT_EN_Msk 0x4UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_DMA_INTERRUPT_STAT_EN_Pos 3UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_DMA_INTERRUPT_STAT_EN_Msk 0x8UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_BUF_WR_READY_STAT_EN_Pos 4UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_BUF_WR_READY_STAT_EN_Msk 0x10UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_BUF_RD_READY_STAT_EN_Pos 5UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_BUF_RD_READY_STAT_EN_Msk 0x20UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_CARD_INSERTION_STAT_EN_Pos 6UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_CARD_INSERTION_STAT_EN_Msk 0x40UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_CARD_REMOVAL_STAT_EN_Pos 7UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_CARD_REMOVAL_STAT_EN_Msk 0x80UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_CARD_INTERRUPT_STAT_EN_Pos 8UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_CARD_INTERRUPT_STAT_EN_Msk 0x100UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_INT_A_STAT_EN_Pos 9UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_INT_A_STAT_EN_Msk 0x200UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_INT_B_STAT_EN_Pos 10UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_INT_B_STAT_EN_Msk 0x400UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_INT_C_STAT_EN_Pos 11UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_INT_C_STAT_EN_Msk 0x800UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_RE_TUNE_EVENT_STAT_EN_Pos 12UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_RE_TUNE_EVENT_STAT_EN_Msk 0x1000UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_FX_EVENT_STAT_EN_Pos 13UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_FX_EVENT_STAT_EN_Msk 0x2000UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_CQE_EVENT_STAT_EN_Pos 14UL
#define SDHC_CORE_NORMAL_INT_STAT_EN_R_CQE_EVENT_STAT_EN_Msk 0x4000UL
/* SDHC_CORE.ERROR_INT_STAT_EN_R */
#define SDHC_CORE_ERROR_INT_STAT_EN_R_CMD_TOUT_ERR_STAT_EN_Pos 0UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_CMD_TOUT_ERR_STAT_EN_Msk 0x1UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_CMD_CRC_ERR_STAT_EN_Pos 1UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_CMD_CRC_ERR_STAT_EN_Msk 0x2UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_CMD_END_BIT_ERR_STAT_EN_Pos 2UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_CMD_END_BIT_ERR_STAT_EN_Msk 0x4UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_CMD_IDX_ERR_STAT_EN_Pos 3UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_CMD_IDX_ERR_STAT_EN_Msk 0x8UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_DATA_TOUT_ERR_STAT_EN_Pos 4UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_DATA_TOUT_ERR_STAT_EN_Msk 0x10UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_DATA_CRC_ERR_STAT_EN_Pos 5UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_DATA_CRC_ERR_STAT_EN_Msk 0x20UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_DATA_END_BIT_ERR_STAT_EN_Pos 6UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_DATA_END_BIT_ERR_STAT_EN_Msk 0x40UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_CUR_LMT_ERR_STAT_EN_Pos 7UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_CUR_LMT_ERR_STAT_EN_Msk 0x80UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_AUTO_CMD_ERR_STAT_EN_Pos 8UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_AUTO_CMD_ERR_STAT_EN_Msk 0x100UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_ADMA_ERR_STAT_EN_Pos 9UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_ADMA_ERR_STAT_EN_Msk 0x200UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_TUNING_ERR_STAT_EN_Pos 10UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_TUNING_ERR_STAT_EN_Msk 0x400UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_RESP_ERR_STAT_EN_Pos 11UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_RESP_ERR_STAT_EN_Msk 0x800UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_BOOT_ACK_ERR_STAT_EN_Pos 12UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_BOOT_ACK_ERR_STAT_EN_Msk 0x1000UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_VENDOR_ERR_STAT_EN1_Pos 13UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_VENDOR_ERR_STAT_EN1_Msk 0x2000UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_VENDOR_ERR_STAT_EN2_Pos 14UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_VENDOR_ERR_STAT_EN2_Msk 0x4000UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_VENDOR_ERR_STAT_EN3_Pos 15UL
#define SDHC_CORE_ERROR_INT_STAT_EN_R_VENDOR_ERR_STAT_EN3_Msk 0x8000UL
/* SDHC_CORE.NORMAL_INT_SIGNAL_EN_R */
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_CMD_COMPLETE_SIGNAL_EN_Pos 0UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_CMD_COMPLETE_SIGNAL_EN_Msk 0x1UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_XFER_COMPLETE_SIGNAL_EN_Pos 1UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_XFER_COMPLETE_SIGNAL_EN_Msk 0x2UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_BGAP_EVENT_SIGNAL_EN_Pos 2UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_BGAP_EVENT_SIGNAL_EN_Msk 0x4UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_DMA_INTERRUPT_SIGNAL_EN_Pos 3UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_DMA_INTERRUPT_SIGNAL_EN_Msk 0x8UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_BUF_WR_READY_SIGNAL_EN_Pos 4UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_BUF_WR_READY_SIGNAL_EN_Msk 0x10UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_BUF_RD_READY_SIGNAL_EN_Pos 5UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_BUF_RD_READY_SIGNAL_EN_Msk 0x20UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_CARD_INSERTION_SIGNAL_EN_Pos 6UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_CARD_INSERTION_SIGNAL_EN_Msk 0x40UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_CARD_REMOVAL_SIGNAL_EN_Pos 7UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_CARD_REMOVAL_SIGNAL_EN_Msk 0x80UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_CARD_INTERRUPT_SIGNAL_EN_Pos 8UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_CARD_INTERRUPT_SIGNAL_EN_Msk 0x100UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_INT_A_SIGNAL_EN_Pos 9UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_INT_A_SIGNAL_EN_Msk 0x200UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_INT_B_SIGNAL_EN_Pos 10UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_INT_B_SIGNAL_EN_Msk 0x400UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_INT_C_SIGNAL_EN_Pos 11UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_INT_C_SIGNAL_EN_Msk 0x800UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_RE_TUNE_EVENT_SIGNAL_EN_Pos 12UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_RE_TUNE_EVENT_SIGNAL_EN_Msk 0x1000UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_FX_EVENT_SIGNAL_EN_Pos 13UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_FX_EVENT_SIGNAL_EN_Msk 0x2000UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_CQE_EVENT_SIGNAL_EN_Pos 14UL
#define SDHC_CORE_NORMAL_INT_SIGNAL_EN_R_CQE_EVENT_SIGNAL_EN_Msk 0x4000UL
/* SDHC_CORE.ERROR_INT_SIGNAL_EN_R */
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_CMD_TOUT_ERR_SIGNAL_EN_Pos 0UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_CMD_TOUT_ERR_SIGNAL_EN_Msk 0x1UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_CMD_CRC_ERR_SIGNAL_EN_Pos 1UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_CMD_CRC_ERR_SIGNAL_EN_Msk 0x2UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_CMD_END_BIT_ERR_SIGNAL_EN_Pos 2UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_CMD_END_BIT_ERR_SIGNAL_EN_Msk 0x4UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_CMD_IDX_ERR_SIGNAL_EN_Pos 3UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_CMD_IDX_ERR_SIGNAL_EN_Msk 0x8UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_DATA_TOUT_ERR_SIGNAL_EN_Pos 4UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_DATA_TOUT_ERR_SIGNAL_EN_Msk 0x10UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_DATA_CRC_ERR_SIGNAL_EN_Pos 5UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_DATA_CRC_ERR_SIGNAL_EN_Msk 0x20UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_DATA_END_BIT_ERR_SIGNAL_EN_Pos 6UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_DATA_END_BIT_ERR_SIGNAL_EN_Msk 0x40UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_CUR_LMT_ERR_SIGNAL_EN_Pos 7UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_CUR_LMT_ERR_SIGNAL_EN_Msk 0x80UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_AUTO_CMD_ERR_SIGNAL_EN_Pos 8UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_AUTO_CMD_ERR_SIGNAL_EN_Msk 0x100UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_ADMA_ERR_SIGNAL_EN_Pos 9UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_ADMA_ERR_SIGNAL_EN_Msk 0x200UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_TUNING_ERR_SIGNAL_EN_Pos 10UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_TUNING_ERR_SIGNAL_EN_Msk 0x400UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_RESP_ERR_SIGNAL_EN_Pos 11UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_RESP_ERR_SIGNAL_EN_Msk 0x800UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_BOOT_ACK_ERR_SIGNAL_EN_Pos 12UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_BOOT_ACK_ERR_SIGNAL_EN_Msk 0x1000UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_VENDOR_ERR_SIGNAL_EN1_Pos 13UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_VENDOR_ERR_SIGNAL_EN1_Msk 0x2000UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_VENDOR_ERR_SIGNAL_EN2_Pos 14UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_VENDOR_ERR_SIGNAL_EN2_Msk 0x4000UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_VENDOR_ERR_SIGNAL_EN3_Pos 15UL
#define SDHC_CORE_ERROR_INT_SIGNAL_EN_R_VENDOR_ERR_SIGNAL_EN3_Msk 0x8000UL
/* SDHC_CORE.AUTO_CMD_STAT_R */
#define SDHC_CORE_AUTO_CMD_STAT_R_AUTO_CMD12_NOT_EXEC_Pos 0UL
#define SDHC_CORE_AUTO_CMD_STAT_R_AUTO_CMD12_NOT_EXEC_Msk 0x1UL
#define SDHC_CORE_AUTO_CMD_STAT_R_AUTO_CMD_TOUT_ERR_Pos 1UL
#define SDHC_CORE_AUTO_CMD_STAT_R_AUTO_CMD_TOUT_ERR_Msk 0x2UL
#define SDHC_CORE_AUTO_CMD_STAT_R_AUTO_CMD_CRC_ERR_Pos 2UL
#define SDHC_CORE_AUTO_CMD_STAT_R_AUTO_CMD_CRC_ERR_Msk 0x4UL
#define SDHC_CORE_AUTO_CMD_STAT_R_AUTO_CMD_EBIT_ERR_Pos 3UL
#define SDHC_CORE_AUTO_CMD_STAT_R_AUTO_CMD_EBIT_ERR_Msk 0x8UL
#define SDHC_CORE_AUTO_CMD_STAT_R_AUTO_CMD_IDX_ERR_Pos 4UL
#define SDHC_CORE_AUTO_CMD_STAT_R_AUTO_CMD_IDX_ERR_Msk 0x10UL
#define SDHC_CORE_AUTO_CMD_STAT_R_AUTO_CMD_RESP_ERR_Pos 5UL
#define SDHC_CORE_AUTO_CMD_STAT_R_AUTO_CMD_RESP_ERR_Msk 0x20UL
#define SDHC_CORE_AUTO_CMD_STAT_R_CMD_NOT_ISSUED_AUTO_CMD12_Pos 7UL
#define SDHC_CORE_AUTO_CMD_STAT_R_CMD_NOT_ISSUED_AUTO_CMD12_Msk 0x80UL
/* SDHC_CORE.HOST_CTRL2_R */
#define SDHC_CORE_HOST_CTRL2_R_UHS_MODE_SEL_Pos 0UL
#define SDHC_CORE_HOST_CTRL2_R_UHS_MODE_SEL_Msk 0x7UL
#define SDHC_CORE_HOST_CTRL2_R_SIGNALING_EN_Pos 3UL
#define SDHC_CORE_HOST_CTRL2_R_SIGNALING_EN_Msk 0x8UL
#define SDHC_CORE_HOST_CTRL2_R_DRV_STRENGTH_SEL_Pos 4UL
#define SDHC_CORE_HOST_CTRL2_R_DRV_STRENGTH_SEL_Msk 0x30UL
#define SDHC_CORE_HOST_CTRL2_R_EXEC_TUNING_Pos  6UL
#define SDHC_CORE_HOST_CTRL2_R_EXEC_TUNING_Msk  0x40UL
#define SDHC_CORE_HOST_CTRL2_R_SAMPLE_CLK_SEL_Pos 7UL
#define SDHC_CORE_HOST_CTRL2_R_SAMPLE_CLK_SEL_Msk 0x80UL
#define SDHC_CORE_HOST_CTRL2_R_UHS2_IF_ENABLE_Pos 8UL
#define SDHC_CORE_HOST_CTRL2_R_UHS2_IF_ENABLE_Msk 0x100UL
#define SDHC_CORE_HOST_CTRL2_R_ADMA2_LEN_MODE_Pos 10UL
#define SDHC_CORE_HOST_CTRL2_R_ADMA2_LEN_MODE_Msk 0x400UL
#define SDHC_CORE_HOST_CTRL2_R_CMD23_ENABLE_Pos 11UL
#define SDHC_CORE_HOST_CTRL2_R_CMD23_ENABLE_Msk 0x800UL
#define SDHC_CORE_HOST_CTRL2_R_HOST_VER4_ENABLE_Pos 12UL
#define SDHC_CORE_HOST_CTRL2_R_HOST_VER4_ENABLE_Msk 0x1000UL
#define SDHC_CORE_HOST_CTRL2_R_ADDRESSING_Pos   13UL
#define SDHC_CORE_HOST_CTRL2_R_ADDRESSING_Msk   0x2000UL
#define SDHC_CORE_HOST_CTRL2_R_ASYNC_INT_ENABLE_Pos 14UL
#define SDHC_CORE_HOST_CTRL2_R_ASYNC_INT_ENABLE_Msk 0x4000UL
#define SDHC_CORE_HOST_CTRL2_R_PRESET_VAL_ENABLE_Pos 15UL
#define SDHC_CORE_HOST_CTRL2_R_PRESET_VAL_ENABLE_Msk 0x8000UL
/* SDHC_CORE.CAPABILITIES1_R */
#define SDHC_CORE_CAPABILITIES1_R_TOUT_CLK_FREQ_Pos 0UL
#define SDHC_CORE_CAPABILITIES1_R_TOUT_CLK_FREQ_Msk 0x3FUL
#define SDHC_CORE_CAPABILITIES1_R_TOUT_CLK_UNIT_Pos 7UL
#define SDHC_CORE_CAPABILITIES1_R_TOUT_CLK_UNIT_Msk 0x80UL
#define SDHC_CORE_CAPABILITIES1_R_BASE_CLK_FREQ_Pos 8UL
#define SDHC_CORE_CAPABILITIES1_R_BASE_CLK_FREQ_Msk 0xFF00UL
#define SDHC_CORE_CAPABILITIES1_R_MAX_BLK_LEN_Pos 16UL
#define SDHC_CORE_CAPABILITIES1_R_MAX_BLK_LEN_Msk 0x30000UL
#define SDHC_CORE_CAPABILITIES1_R_EMBEDDED_8_BIT_Pos 18UL
#define SDHC_CORE_CAPABILITIES1_R_EMBEDDED_8_BIT_Msk 0x40000UL
#define SDHC_CORE_CAPABILITIES1_R_ADMA2_SUPPORT_Pos 19UL
#define SDHC_CORE_CAPABILITIES1_R_ADMA2_SUPPORT_Msk 0x80000UL
#define SDHC_CORE_CAPABILITIES1_R_HIGH_SPEED_SUPPORT_Pos 21UL
#define SDHC_CORE_CAPABILITIES1_R_HIGH_SPEED_SUPPORT_Msk 0x200000UL
#define SDHC_CORE_CAPABILITIES1_R_SDMA_SUPPORT_Pos 22UL
#define SDHC_CORE_CAPABILITIES1_R_SDMA_SUPPORT_Msk 0x400000UL
#define SDHC_CORE_CAPABILITIES1_R_SUS_RES_SUPPORT_Pos 23UL
#define SDHC_CORE_CAPABILITIES1_R_SUS_RES_SUPPORT_Msk 0x800000UL
#define SDHC_CORE_CAPABILITIES1_R_VOLT_33_Pos   24UL
#define SDHC_CORE_CAPABILITIES1_R_VOLT_33_Msk   0x1000000UL
#define SDHC_CORE_CAPABILITIES1_R_VOLT_30_Pos   25UL
#define SDHC_CORE_CAPABILITIES1_R_VOLT_30_Msk   0x2000000UL
#define SDHC_CORE_CAPABILITIES1_R_VOLT_18_Pos   26UL
#define SDHC_CORE_CAPABILITIES1_R_VOLT_18_Msk   0x4000000UL
#define SDHC_CORE_CAPABILITIES1_R_SYS_ADDR_64_V4_Pos 27UL
#define SDHC_CORE_CAPABILITIES1_R_SYS_ADDR_64_V4_Msk 0x8000000UL
#define SDHC_CORE_CAPABILITIES1_R_SYS_ADDR_64_V3_Pos 28UL
#define SDHC_CORE_CAPABILITIES1_R_SYS_ADDR_64_V3_Msk 0x10000000UL
#define SDHC_CORE_CAPABILITIES1_R_ASYNC_INT_SUPPORT_Pos 29UL
